Configuration.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-29 Wed 20:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Configuration of a Program</title>
<meta name="author" content="Paige Roy" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Configuration of a Program</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc15d083">1. what program and files</a></li>
<li><a href="#orgcd10064">2. what is urxvt</a></li>
<li><a href="#org76901b5">3. .Xresources</a>
<ul>
<li><a href="#org03abb1d">3.1. font</a></li>
<li><a href="#org027e0b4">3.2. perl extension</a></li>
<li><a href="#orgf197446">3.3. transparency</a></li>
</ul>
</li>
<li><a href="#org039d8e0">4. .bashrc</a></li>
<li><a href="#orgbb76ff2">5. more configs</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc15d083" class="outline-2">
<h2 id="orgc15d083"><span class="section-number-2">1.</span> what program and files</h2>
<div class="outline-text-2" id="text-1">
<p>
The program we will be editing to make less atrocious, is the
popular rxvt-unicode terminal emulator (henceforth referred to by
its command urxvt). The file we will be editing is the .Xresources
file. This is a generalized user configuration file to set up
various X programs, and is loaded on login.
</p>
</div>
</div>
<div id="outline-container-orgcd10064" class="outline-2">
<h2 id="orgcd10064"><span class="section-number-2">2.</span> what is urxvt</h2>
<div class="outline-text-2" id="text-2">
<p>
urxvt is a terminal emulator. it supports unicode fonts, extension with
perl, and fast.
</p>
</div>
</div>
<div id="outline-container-org76901b5" class="outline-2">
<h2 id="org76901b5"><span class="section-number-2">3.</span> .Xresources</h2>
<div class="outline-text-2" id="text-3">
<p>
By default, urxvt looks hideous. This is it's default configuration.
What we will do in the .Xresources is configure the colours for the
basic urxvt terminal, and add a perl extension. One quick and nice
colour scheme creator online I use is terminal.sexy (yes&#x2026; that is
it's real name). Using it we can generate our default .Xresouces file
under the export option. Once it is exported, there are three more
colours which you might want to add: foreground<sub>bold</sub>, highlightColor,
highlightTextColor, colorRV. To notice any changes to the terminal,
the .Xresources file needs to be reloaded, this is done via
'xrdb .Xresources'. Now that the terminal doesn't hurt our eyes,
we can add some more helpful little changes.
</p>
</div>
<div id="outline-container-org03abb1d" class="outline-3">
<h3 id="org03abb1d"><span class="section-number-3">3.1.</span> font</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The first change we can make is the font. Here we are using Adobe
Source Code Pro. Its a basic unicode font and is fairly popular.
More importantly it is installed on the live image so we can use it.
Installing fonts really isn't fun at all, I've installed many fonts
and it does NOT get easier. The line we are going to add to the file
is 'URxvt.font: xft:Source Code Pro:size 8'. We are using an xft font
here, which is something you're not actually supposed to do if you
want more speed for the terminal emulator. Some personal choices
I have configured is the cursor blinking, and removing the scrollbar.
To do so: 'URxvt.scrollbar: false' and 'URxvt.cursorBlink: true'.
</p>
</div>
</div>
<div id="outline-container-org027e0b4" class="outline-3">
<h3 id="org027e0b4"><span class="section-number-3">3.2.</span> perl extension</h3>
<div class="outline-text-3" id="text-3-2">
<p>
urxvt is able to be extended using perl programs. One useful extension
is selection-to-clipboard. This allows anything highlighted in the
terminal to be copied to the clipboard. Add these lines to the .Xresources
file:
'URxvt.per-ext-common: selection-to-clipboard
URxvt.clipboard.autocopy: true
URxvt.keysym.M-c: perl:clipboard:copy
URxvt.keysym.M-v: perl:clipboard:paste'
</p>
</div>
</div>
<div id="outline-container-orgf197446" class="outline-3">
<h3 id="orgf197446"><span class="section-number-3">3.3.</span> transparency</h3>
<div class="outline-text-3" id="text-3-3">
<p>
If you care about transparency (are wrong) you can do so with the
following lines added to the file
'URxvt.depth: 32
URxvt.background: [95]#000000'
with the value in the brackets being the level of transparency.
</p>
</div>
</div>
</div>
<div id="outline-container-org039d8e0" class="outline-2">
<h2 id="org039d8e0"><span class="section-number-2">4.</span> .bashrc</h2>
<div class="outline-text-2" id="text-4">
<p>
The 'shell' which is what interprets all of our commands through
the command line, in our case is bash, the boune again shell.
It can be configured in the .bashrc file on a per user basis.
Manjaro already has a heavily configured .bashrc file by default,
and there really isn't much you can add. However in here, we can
place alias's. An alias in the shell is a command which can be
used to refer to another command, or even a script. You can define
these aliases right here in .bashrc for ease of use. Manjaro has
by default some commented aliases in the file by default, but we
are going to add some that I personally use and are helpful.
'alias ls='ls &#x2013;color=auto'
alias copyd='rsync -r &#x2013;progress'
alias copy='rsync &#x2013;progress'
alias chmox='chmod +x''
</p>
</div>
</div>
<div id="outline-container-orgbb76ff2" class="outline-2">
<h2 id="orgbb76ff2"><span class="section-number-2">5.</span> more configs</h2>
<div class="outline-text-2" id="text-5">
<p>
If you use vim you have a .vimrc file, emacs you should have an
emacs directory. The vast majority of programs you will install
as a user have their user based configuration files in the .config
directory.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Paige Roy</p>
<p class="date">Created: 2023-03-29 Wed 20:32</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
